Tekla Open API Reference for Tekla Structures 2025
DistanceList.IsReadOnly Property
 Gets a boolean value indicating whether the collection is read-only.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
 A boolean value indicating whether the collection is read-only.
Implements
ICollection<T>.IsReadOnly
Remarks
DistanceLists are always mutable.
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace